#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "94c60b5527f8daeca5df0197abf2cd75" -> "a683ea17dd608f3590e42930afdcd7f2"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "79232d6554dd2eb5f679253ee7af430f" -> "5d164069761d4eccae988ff692ff1bea"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "92c67221f6394b6e9bbfb95508d3c6ce" -> "2b56bab2a33ef81fba1f376101fbd59b"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "a68c2e53325f5c05862c4d84c47ae9c0" -> "f81e3685dd31df09782b1e5087bc84f6"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "e8dc435a768174e901f4a37bd61cdb6d" -> "7c98c0328532846fcb9ca441dff524e4"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "58205e3b9fa0e62b1b0775101a3ba0dd" -> "847c4b0c07f72c7119d453b15d7002b2"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "9ac3498f6b2f3552df4e64b10d5475a9" -> "0c901c4f6c8ec6d7000831adc6468497"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "85e2799416bd4715be28288fe2dec60b" -> "da87e72344d4b97e225d39691bd2529b"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "f1f8577270136526874ceea613849d1e" -> "521cc811790843193f72b298bd750dc5"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "f5f0153011f71e2eb80a234246dbe9e6" -> "e3f2f7a434fd3812e3ef6de6bd4000e7"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "82bf48486c047e70101bc24943a9f108" -> "dae0b26d4bacb5e03e03c842e4299195"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "b2368f743c68c7cddb6283fb0d0facf9" -> "49c135409bed6e9a50cb35092c4b0c96"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "13c25d7a06c5a9795bec7a0cbd2a3f1c" -> "a02d00e6b30c65191852fdcdad39bb13"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "42b3eb42cf1380d7c58c0f5a88c1cb31" -> "0bb0b0445896560b110df75ba9992aa1"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "f4defa5d6b0c8c853c3a6c5ac7bb1773" -> "65085c42c62f93e891cc3141f2a3d12a"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "78c2768b42fe54c72799542ff0608a46" -> "05175244b714f45de34e2c7d4b95dcf0"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "6b970aae15cc1510ce2eda596197203d" -> "dc207e11f135cf604c5ea7107b8f61fa"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "d1d4d996c5a4bb9e858e6eda9db603d0" -> "e7deded2e79f900e276e807d9cdf83f5"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "3b596fdff9a475ebae6c6ed41052b4f1" -> "6eb102554e501097a7dc6b08afa0ea1a"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "afea37fed800073c2359301664153a40" -> "f21991026fb8cdf95d46678e58a12558"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "c62398c5f9140362264038e01a55ed93" -> "21f0ebcab78b35324bf0614b193d5bbe"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "2a7d5dfd2536f33d88819e34f7403919" -> "18be917d2dcbb9e0fccc38cb54d1add8"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "260d70bcc933ef2ceaba6575b6e5d6f4" -> "c0af8aa11abf2f45fcea5e6c7bcbb267"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "e7dc79dd53d2befd070f71ec338248bf" -> "266c9b52a0f67e00f182b73f06deb9e9"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "c3bbb19f713b88cafb6fc3f4a836f0cc" -> "889667f0768ef2a659260c9b1b60c21a"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "96cd754a691ebae1dfbdec9b0b5eadcc" -> "d69213b2e88fc51896af1ec1b496850d"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "c473d254adc846b7ad8a0171b15e6c2f" -> "1021cd1352ea2936da6852454684043d"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag               = "bb086d0e1bb147590046cdf357e0ed03" -> "58243612760922cc1466f018d1b3242a"
        id                 = "lambdas/demo/get_full_year_total_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "5a7f99b7d446f91792dc30925e63850b" -> "6d80c1fc3c2e68fb53235bea86b2db45"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "66c794c7f8fa1284f46a99673b4d9473" -> "ba58540b5f36dffe6fadf48ed16e994a"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag               = "c9b28da59f7f538ccc6a142177cb13a9" -> "4a538984caffa9483b0913afab0760fa"
        id                 = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "272c0a839d74a35cd8748a7cf7053a13" -> "88cea402c0fe599a69e502bb8acf84da"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "2124c527be51ac61980fbcaed3676da7" -> "23503b846b08575e69c4476f6f0e98de"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "fd6dc8c9c31e33269d179805a95350db" -> "acd5b3bcd8953d5d45c8149dac11cd10"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "0c3cc57fe56983a4b65dbfc39bed1acd" -> "dc01884cd1e56f22189332558c960686"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "871dec6a0beb697ff82d22699e5a2a83" -> "578cb81dfde92b7afa75f64fca38627e"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "912f45c41ff0aa6fcdfda0e750443ec5" -> "4b8b4fcbab5760d209f52c1f6f26d34d"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "7ff176fb44a4b68c7675d17bc4748f1f" -> "428aa094b2aba2d2eab754a6b2acb35c"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "0c436357a3da9b5f3935c81e08bb12bd" -> "e9749006ac9bc4edf7da6dae27e658f1"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag               = "24c3f8bd882347c540242ae31498b982" -> "f0488001dbdde3429afb66a40c1a9565"
        id                 = "lambdas/demo/modify_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "415620d8a5395927d897a132edc1b8f2" -> "eff48a70a28d9669948fbe0309901539"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "a98ee06a8e2dce011732b15b9ebbbcfa" -> "5ef0c600f240e9019e66cb59bdb3866c"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "081a7b86a6fcf68fa6fe573fecfd3d3e" -> "243e114fa94257650216d16e52ad3d2b"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "bd89292f9c54ce37ad5231d2b252f1cd" -> "14b1ec62cf044365f0c92854d54a88ad"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "edd0126229a51aba4774b5d764d72683" -> "e8c6b1e608fbd4b941f0832e8f8b7e92"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "1ccb452cd430d1aa6ca42a46f8e6c9f0" -> "461d1dc193c58f82107b664cd5bfe57b"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "WgK47nsHj0Dw1D02uaYqKWzHsTaOIxp6VOclnEnZI6M=" -> "IMOMX2/bWanbr22ZM+nsuqYIcJ4QSgSe1fd5KxA2Hys="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "xWA87zy2Y9BZp5EDnrGvbihQCj3d/uPqHf4oWBkSgXw=" -> "MZTJVNMXxni6yAWJKPpN+ECSqwPeUDYm5A03QFaorqI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "C2cJrTk3m3mcDa3oKuKmdAV6zyigAEPhsHkF/vYymqo=" -> "r19/wn2dNVgegxd9gCNuAHp9Td4FK2sqxUDDFNcQMeU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "4j/yTl3zSl8Xj98N2SF71sU0cgf4Hdoeh0hRBuz6WmE=" -> "WowIo+cki/or0DU6nIbtjn6LpbBZWQpvksaR2dLdliU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "wgkKDRBroe0Esu1dvaPG4wMMNMmpOe6gNWud05EqbEE=" -> "8nj2HBNhsbOV3c2qGsIJFPgz+yBDY9WQR/rlWo8nVIo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "keKE5xluyiBWRyEUPkLqz7kiJC4ht/+8f01UvPCOyIM=" -> "RlRtrYRwqlmuL/vcoK+evUTBnJWeweKobXy6MTRvZWY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "8HeBBeQ5oRD1uyH/wT/lUPXxnDyuYbSTLi4izJi9aQY=" -> "MzKY5+skFR5e/GuuOARsroRxNfj1UJQ01rU327h8Uj0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "Za8OJskPdWh9YF05PgcvMtld8AIzKncyp3B4dFtWkxE=" -> "3XMPMK1YCZfWCGOBLUQoWAUU7TeoTuUiwFyLGqDw4/g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-01-25T21:19:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "M4gXGmCLMXqupk6wZN/KQJc53DMoy4vrce9eaxtfi8I=" -> "M0yOJWKJLBInw5QEE8JJIMdp2SbedDDF4Ipg6N03dcs="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "vRm9sB70MS9C7x9Y26Y0Cccgs1pI7VVAqbr1H+cbZf0=" -> "DdvSJd3n6AoXeFax0p1NSN9cOMsbEX8yzx/8rJQNrPg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "Jm16VOPilOpL3sTRi/dEu4TPATJdINzpU66PQSbRBdE=" -> "Nl/GqRa88qP4L2WJnkkgJWuanTA9pjnEJwarC6J4z5o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "hAAX9DjfnzNpvPEAD45ft2dhcIkOBbzeRRYsX10tnvk=" -> "olC6lEsqaLGfPExGIWVO9sfOiXwr8qnf0ltJdkcs9Gs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "a92uRQKINNEQhxFzjxpCMYpKc2mhrZT6kTVgqEJmoio=" -> "/4wyxxn7CboaAcBB5n6QCLTYvntSxkACaw73I06C1AM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "tgyGFB34lS/S29dvwIrmU2KdmmaP/aVf5+UmlEwNtck=" -> "goJmTjbS9EewbY7BNHsf0pc3pyQWgY66yNZm9yO2iH4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "EbZ3AzNyS5cF9ExTnAjxXS+7NLvX82CiThJxKAb0Y6s=" -> "mY06xU9K/2330zVnlCnRzwvIeVcRPpk7/4MQzT9ctzY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "hQZHs2P14q3/BbCAKb5N23MkncCeBxF26NK9ApxTjKU=" -> "3qHWKUivUh2opNqxLipxNMTUCEZhM+mqu7kqgiKE+Ys="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "boJGkWwqxknroaImXVKRe/Jf/gJm9T1OgFL90QpXyKs=" -> "vZi9zAzRgpAfQk82147/t5MgBoR6b1SRgXsCUZM9M84="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:37.000+0000" -> (known after apply)
      ~ source_code_hash               = "G1Wiu8uJSYb4AxVrwOoygbAABjeeLcDGtO70brDeYqw=" -> "6lJJGfFA7tpksPPF74vQb1uCGrib9GUq8CF7BsK8+64="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "VGJoFbtoR5JVLJBYkgWjo4g8NqNHgy7NdYlZU6afhCA=" -> "A6e8HGtTYGNEQpxGjU+cisbrZEGYVOgWGwwq9FskXjQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-01-26T00:33:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "KUQDWkXrm/3SHAM5r2S+lul/MOzixNCk/7V8tSGbzD4=" -> "RwV2n0gGzE+20yrE4Cben1cprmBXp6WUI0iX+m83HtI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "F6q9DHXI/6S0ESwWw4x0gGotR++ja0RvKocNrUSv2H4=" -> "+mpyC3PrR9plaU7bCfwBs50VUATHPab3TD4/pBVe3t0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "T6trod4Mu7YdcRBFN46IqBFRkzK3Cdze3tRioUHFqNA=" -> "e1cU00ZZXLQNwt0tayAtx4nP2Kubo5k8kj2nzM4Cdno="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "FWJsAbHzxg6Z+f7eQ9cOuv5Vjt0mUzkVbNxWmmSAwjE=" -> "67wCVwKeY7gWMBf/Y1Qbj62CjXMIOsgtlFQcKFn0HMc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "htNT4jcrZi8jKazvdrEH/ddOqkZHtJLropbF2Q9K0xg=" -> "46Yoe6xelcQqIlFnE1exQAaX3IxC2oui//boW21ngkw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-25T23:57:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "oZWlk6u5nuOOmRJjAfmMZ3U3vJxFAuxLDzqUu/h+xLc=" -> "E88FqmxzAodo7nkwzW+XehKPAmC42FgUVAt42N1SuZY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-01-26T00:00:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "yEqIWdZ04xJNYj54iMf1eoWSWIjJjxnG5hQC9MlFH6E=" -> "h57XmOuL6lHKHSeX1DqQYAlB9Cn7pURXWPJqXe8sczM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "yC/h6ccSB7IhmPwNbTZAD/u3h0yG1Wumm1jLgA/JN4c=" -> "3oS0Rlddk7+5XF+xJrGHuJ4w8pafOn3f/E9te8j2mvw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "hehpgnaeSqt6lLge9IKvDhByzq5fdMAZijolVbFn2u0=" -> "k/hAH4WCbervSs+tqeNg1Pam48XiHjFnU1+kMMmGb4w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "OexHWWmRk1Lkfg9O9mej8nJU5mik6+zZvvMgquV/WKo=" -> "/Ayhc+5IRvpEIchpRZM3XTpr1Ne+jag0Vbir9ClhNN0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "W69/p3U/ebLRfE35XVKwfFKZS88TGJG+alM+8udfBcA=" -> "ZJ9oqOKNbitUakIlADPlCYJ/nM7liqAjYyIP90083R4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "n82UeTa6m+4Q7WzO2dkG/Z4kNqZsLZVWmHBj9QoV5hA=" -> "tFd0+ypbQfjR5/qRIPgc+S0LPDY9LNOHm1FQZZPXvqE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "aqhc18kZxyEQqjECAwMCvWp+RkR0g7X7lO2KsS5NNpg=" -> "MaY/dg0Yy2odGD1iAMqY2eB5pTn55SvEhhxOWhQcxCE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "x0koqkk8bU2KSXmEHeSo3/2Z09SdFrO4XCx7yXd97ak=" -> "Ok4w+js5bY/bLxXS31+DiT1d93pPg4USE/HiJI5n2/A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "J9Vq/G3lRbh+Pz6BKahLT/NZS6W0bGxo6dneo776YGU=" -> "oJHGV2RfmWyRW4CU0SwjO+NeL300GnmhSABx3kTDpTc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "LNYt3xRXpj0K7PmYxeDGtx7j1KwVYU6Nk7DagcV318w=" -> "F9SXgqfIVSIv4CQoCjHsHa9LvK31yaE8aoWQ4eTWdN8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "9fiKCl9+XWEhkQa+lbA9H9iJwhM6xX8liToyEUhdJAc=" -> "W5oS09QNJ+g0TcswgTEOs0ltVrNp75nhW4YeNtLW/Ss="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "QErCqljDkVSWvcAm7mcO/NzfF0ev0iZXVWhreAWLVCI=" -> "6idzCZw9lT/IBT7Krim8mDpXGJaqjIT7ksNpXC7wkNs="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "run9azCvXCVsPqafeFT7jGPxTNOVYnS8dqUhk4zLO+8=" -> "c7NJKWGLXKf3QhSn+kFr3KjuCUMnrja/KDk+HXFwTFU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "ptETTGKf/NosJ4NY/fd1nvfuOGjqAnqogwfGeYOeMoc=" -> "yH+iYgtko99UyYsxPYIX1jmFwNkh8KBRKzJL4X7JJXM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "Rbi+XBtNCorEcD3vMnFuUo6uE2yMgKCSG9/D/jJrKC8=" -> "GU55WoUTLEZDBB1xgKG71MPLC70ydBlqWwZOj3bAgpU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "srEi9SsdMVd7567pOhnOEicJ89uigfJ+aHjEatG0J8c=" -> "k2Tep3YdPBU1pNvbFqjGcHy8A6Ips/VoAAAfme36TpE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "rYXBSNCTVlb2ia7TAiDLZRsd91Xunc4zVALvSXukojo=" -> "jgroFj9nuwBG0QNjtRsRuZqP9Nc1WJm0Bczdh072HVU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "CKQKgg2x1ksSdqapfFS+QlXthRDK8DtewJbUn09g94U=" -> "See44kemPgX6zJKgm/soIBAhtledF/byo6jcajvd21E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "/r1/ZmnYNMtdXR5S8RmhLE3GJcvHkfai2kLPqtAb/gk=" -> "9Ik65ceahLLK3A/eLMg0Faj/LcW4Jc3EMp7St4NfvjQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "S9uEpQsKnvEH8Ezbg0JyVZOxgCJYIEvRJS+VAjCtjWg=" -> "XruZXiCX208XkD8YbxlEAmEhlbAhm+U2bZHJmyOXpBA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-01-25T21:19:59Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "0w1zu0" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-01-25T21:19:58Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-01-25T21:19:58Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 93 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*